## `terraform/keeping`
#### Terraform Format and Style 🖌`'No changes needed.'`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.custom_chatbot.module.chatbot_slack_configuration.data.local_file.cloudformation_template: Reading...
module.custom_slash_command.module.dispatch_backup_function.data.external.archive_prepare[0]: Reading...
module.custom_iam_role_for_github.data.http.github_actions_openid_configuration: Reading...
module.custom_chatbot.module.chatbot_slack_configuration.data.local_file.cloudformation_template: Read complete after 0s [id=34d55e91682b29a9c65529178b71ea86f6a6a99b]
module.custom_iam_role_for_github.data.http.github_actions_openid_configuration: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration]
module.custom_iam_role_for_github.data.tls_certificate.github_actions: Reading...
module.custom_slash_command.module.dispatch_backup_function.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.custom_slash_command.module.dispatch_backup_function.local_file.archive_plan[0]: Refreshing state... [id=78f2020f239be6309b8af0fd851b4b39b0176a7d]
module.custom_slash_command.module.dispatch_backup_function.null_resource.archive[0]: Refreshing state... [id=500718698359069538]
module.custom_iam_role_for_github.data.tls_certificate.github_actions: Read complete after 0s [id=43add1749d6d9832e0a8fca0784941273380c63a]
module.custom_slash_command.module.dispatch_backup_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.custom_slash_command.module.dispatch_backup_function.data.aws_caller_identity.current: Reading...
module.custom_vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-080b3749ba65ae3d7]
module.custom_iam.aws_iam_role.chatbot-notification-only: Refreshing state... [id=chatbot-notification-only]
module.custom_slash_command.module.dispatch_backup_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/dispatch_workflow_from_slack-function]
module.custom_iam.aws_iam_role.main_ecs_tasks: Refreshing state... [id=ecs_tasks-minecraft-test-role]
module.custom_sns.data.aws_iam_policy_document.policy_for_encrypt_sns_topic: Reading...
module.custom_slash_command.module.dispatch_backup_function.data.aws_region.current: Reading...
module.custom_iam_role_for_github.aws_iam_policy.github_actions: Refreshing state... [id=arn:aws:iam::528163014577:policy/minecraft-test-github-actions]
module.custom_iam.aws_iam_policy.chatbot-notification-only: Refreshing state... [id=arn:aws:iam::528163014577:policy/chatbot-notification-only]
module.custom_slash_command.module.dispatch_backup_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.custom_slash_command.module.dispatch_backup_function.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.custom_slash_command.module.dispatch_backup_function.data.aws_partition.current: Reading...
module.custom_slash_command.module.dispatch_backup_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.custom_iam.aws_iam_role.task_execution_role: Refreshing state... [id=minecraft-test-ecs_tasks_execution-role]
module.custom_sns.data.aws_iam_policy_document.policy_for_encrypt_sns_topic: Read complete after 0s [id=3154560550]
module.custom_iam_role_for_github.aws_iam_role.github_actions: Refreshing state... [id=minecraft-test-github-actions]
module.custom_iam_role_for_github.aws_iam_openid_connect_provider.github_actions: Refreshing state... [id=arn:aws:iam::528163014577:oidc-provider/token.actions.githubusercontent.com]
module.custom_slash_command.module.dispatch_backup_function.aws_iam_policy.additional_json[0]: Refreshing state... [id=arn:aws:iam::528163014577:policy/dispatch_workflow_from_slack-function]
module.custom_slash_command.module.dispatch_backup_function.data.aws_caller_identity.current: Read complete after 0s [id=528163014577]
module.custom_slash_command.module.dispatch_backup_function.aws_iam_role.lambda[0]: Refreshing state... [id=dispatch_workflow_from_slack-function]
module.custom_sns.aws_kms_key.for_encrypt_sns_topic: Refreshing state... [id=fbe3a2e1-dee7-431a-8206-9cd2092c08df]
module.custom_iam.aws_iam_role_policy_attachment.chatbot-notification-only-attach: Refreshing state... [id=chatbot-notification-only-20231214232321650500000002]
module.custom_iam_role_for_github.aws_iam_role_policy_attachment.github_actions: Refreshing state... [id=minecraft-test-github-actions-20231214232322111300000003]
module.custom_iam.aws_iam_role_policy.execution_policy: Refreshing state... [id=minecraft-test-ecs_tasks_execution-role:minecraft-test-task-execution-policy]
module.custom_iam.aws_iam_role_policy.ExecuteCommand: Refreshing state... [id=ecs_tasks-minecraft-test-role:minecraft-test-ExecuteCommand]
module.custom_iam.aws_iam_role_policy.firelensPolicy: Refreshing state... [id=ecs_tasks-minecraft-test-role:minecraft-test-firelensPolicy]
module.custom_slash_command.module.dispatch_backup_function.aws_iam_role_policy_attachment.additional_json[0]: Refreshing state... [id=dispatch_workflow_from_slack-function-20231214232321636700000001]
module.custom_slash_command.module.dispatch_backup_function.data.aws_iam_policy_document.logs[0]: Reading...
module.custom_slash_command.module.dispatch_backup_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1844424421]
module.custom_slash_command.module.dispatch_backup_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::528163014577:policy/dispatch_workflow_from_slack-function-logs]
module.custom_slash_command.module.dispatch_backup_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=dispatch_workflow_from_slack-function-20231214232322152400000004]
module.custom_slash_command.module.dispatch_backup_function.aws_lambda_function.this[0]: Refreshing state... [id=dispatch_workflow_from_slack-function]
module.custom_sns.aws_kms_alias.for_encrypt_sns_topic_alias: Refreshing state... [id=alias/cwa/for_encrypt_sns_topic]
module.custom_sns.aws_sns_topic.main: Refreshing state... [id=arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic]
module.custom_sns.aws_sns_topic_subscription.main: Refreshing state... [id=arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic:dc0a832c-07a7-4d2f-8e2b-6de364155c79]
module.custom_chatbot.module.chatbot_slack_configuration.aws_cloudformation_stack.chatbot_slack_configuration: Refreshing state... [id=arn:aws:cloudformation:ap-northeast-1:528163014577:stack/chatbot-slack-configuration-minecraft-test-chatbot/ca09cc70-9ad7-11ee-83e2-0e9630bea38d]
module.custom_vpc.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0be4b180c2baaa074]
null_resource.name: Refreshing state... [id=7654444806662221133]
module.custom_vpc.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0af9255bf2de56654]
module.custom_vpc.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-019542f68b3faf486]
module.custom_vpc.module.fargate_sg.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-07934f64784cd1b97]
module.custom_vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0b514cfc7d0eb8f87]
module.custom_vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-038ab87acb09d9140]
module.custom_vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-09e08a3f393bc9cdd]
module.custom_vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0c61e63473f694831]
module.custom_slash_command.module.dispatch_backup_function.aws_lambda_function_url.this[0]: Refreshing state... [id=dispatch_workflow_from_slack-function]
module.custom_vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-04380aaba84b96660]
module.custom_vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0dd79ede70dc8f571]
module.custom_vpc.module.fargate_sg.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-3461214470]
module.custom_vpc.module.fargate_sg.aws_security_group_rule.ingress_with_self[0]: Refreshing state... [id=sgrule-2244126218]
module.custom_vpc.module.fargate_sg.aws_security_group_rule.ingress_with_cidr_blocks[1]: Refreshing state... [id=sgrule-2747649960]
module.custom_vpc.module.fargate_sg.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-3776291969]
module.custom_vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-09e08a3f393bc9cdd1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.custom_slash_command.module.dispatch_backup_function.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "500718698359069538" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1719416883015956000" -> "1719416939348440000"
            # (1 unchanged element hidden)
        }
    }

  # module.custom_vpc.module.fargate_sg.aws_security_group_rule.ingress_with_cidr_blocks[1] must be replaced
-/+ resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      ~ from_port                = 80 -> 8080 # forces replacement
      ~ id                       = "sgrule-2747649960" -> (known after apply)
      ~ security_group_rule_id   = "sgr-00341f67fe1a46815" -> (known after apply)
      + source_security_group_id = (known after apply)
      ~ to_port                  = 80 -> 8080 # forces replacement
        # (7 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>